# SetActiveWorksetId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetTable..::..SetActiveWorksetId Method
WorksetTable Class See Also
---
Sets the active workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public void SetActiveWorksetId(
	WorksetId worksetId
)
```

Visual Basic
---
```text
Public Sub SetActiveWorksetId ( _
	worksetId As WorksetId _
)
```

Visual C++
---
```text
public:
void SetActiveWorksetId(
	WorksetId^ worksetId
)
```

# ### Parameters
worksetId
    Type: Autodesk.Revit.DB..::..WorksetId The workset Id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | There is no workset in the document with this id. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WorksetTable Class
Autodesk.Revit.DB Namespace